{"keras_version": "2.0.9", "config": [{"config": {"kernel_constraint": null, "batch_input_shape": [null, 216, 1], "dtype": "float32", "bias_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "activity_regularizer": null, "filters": 256, "name": "conv1d_1", "strides": [1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_size": [5], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same"}, "class_name": "Conv1D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"dilation_rate": [1], "kernel_size": [5], "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 128, "name": "conv1d_2", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "strides": [1], "use_bias": true, "padding": "same"}, "class_name": "Conv1D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.1}, "class_name": "Dropout"}, {"config": {"strides": [8], "trainable": true, "pool_size": [8], "name": "max_pooling1d_1", "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"dilation_rate": [1], "kernel_size": [5], "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 128, "name": "conv1d_3", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "strides": [1], "use_bias": true, "padding": "same"}, "class_name": "Conv1D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"dilation_rate": [1], "kernel_size": [5], "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 128, "name": "conv1d_4", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "strides": [1], "use_bias": true, "padding": "same"}, "class_name": "Conv1D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "units": 2, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}